## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.keyvault.azurerm_key_vault_key.key1 will be created
  + resource "azurerm_key_vault_key" "key1" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03"
      + n                       = (known after apply)
      + name                    = "kv-aztf-log-prod-ne-001-kek"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

  # module.roleassignment-uami-kv.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03/providers/Microsoft.Authorization/roleAssignments/2989d223-db56-9160-fac0-bc5681c04208" -> (known after apply)
      ~ name                                   = "2989d223-db56-9160-fac0-bc5681c04208" -> (known after apply)
      ~ principal_id                           = "02980afb-c222-4a6f-9436-fb7dad939c6a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/e147488a-f6f5-4113-8e2d-b22465e65bf6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.uami.data.azurerm_user_assigned_identity.uami-logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "uami-logs" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "uami-aztf-log-prod-ne-02"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-02"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>